Tekla Open API Reference for Tekla Structures 2025
PreferredPlacingTypes.AlongLineOrWithLeaderLinePlacingType Method
 The object is placed using the along line placing as the first option. If there is no room for the first option the fallback option will be used. The fallback option is placing the object with a leader line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase AlongLineOrWithLeaderLinePlacingType()
Public Shared Function AlongLineOrWithLeaderLinePlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new along line or with leader line placing type instance.
See Also
Reference
PreferredPlacingTypes Class
Tekla.Structures.Drawing Namespace